; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	thermograph3 - mode
	spectrograph2 - mode
	image1 - mode
	infrared0 - mode
	GroundStation0 - direction
	GroundStation4 - direction
	GroundStation1 - direction
	Star3 - direction
	Star5 - direction
	Star2 - direction
	Phenomenon6 - direction
	Star7 - direction
	Planet8 - direction
	Star9 - direction
	Star10 - direction
	Planet11 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 spectrograph2)
	(supports instrument0 infrared0)
	(calibration_target instrument0 GroundStation1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star7)
	(supports instrument1 infrared0)
	(calibration_target instrument1 Star5)
	(calibration_target instrument1 Star3)
	(supports instrument2 thermograph3)
	(supports instrument2 image1)
	(supports instrument2 infrared0)
	(calibration_target instrument2 Star2)
	(supports instrument3 spectrograph2)
	(supports instrument3 infrared0)
	(supports instrument3 thermograph3)
	(calibration_target instrument3 Star2)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star10)
)
(:goal (and
	(pointing satellite1 Star5)
	(have_image Phenomenon6 spectrograph2)
	(have_image Star7 thermograph3)
	(have_image Planet8 thermograph3)
	(have_image Star9 infrared0)
	(have_image Star10 spectrograph2)
	(have_image Planet11 spectrograph2)
))

)

; plan
1. (turn_to satellite1 star2 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 star2)
   goals met: 0 of 7
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 7
3. (calibrate satellite1 instrument3 star2)
   added: (calibrated instrument3)
   goals met: 0 of 7
4. (turn_to satellite1 planet11 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 planet11)
   goals met: 0 of 7
5. (take_image satellite1 planet11 instrument3 spectrograph2)
   added: (have_image planet11 spectrograph2)
   goals met: 1 of 7
6. (turn_to satellite1 phenomenon6 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 phenomenon6)
   goals met: 1 of 7
7. (take_image satellite1 phenomenon6 instrument3 spectrograph2)
   added: (have_image phenomenon6 spectrograph2)
   goals met: 2 of 7
8. (turn_to satellite1 planet8 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 planet8)
   goals met: 2 of 7
9. (take_image satellite1 planet8 instrument3 thermograph3)
   added: (have_image planet8 thermograph3)
   goals met: 3 of 7
10. (turn_to satellite1 star10 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 star10)
   goals met: 3 of 7
11. (take_image satellite1 star10 instrument3 spectrograph2)
   added: (have_image star10 spectrograph2)
   goals met: 4 of 7
12. (turn_to satellite1 star7 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 star7)
   goals met: 4 of 7
13. (take_image satellite1 star7 instrument3 thermograph3)
   added: (have_image star7 thermograph3)
   goals met: 5 of 7
14. (turn_to satellite1 star9 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 star9)
   goals met: 5 of 7
15. (take_image satellite1 star9 instrument3 infrared0)
   added: (have_image star9 infrared0)
   goals met: 6 of 7
16. (turn_to satellite1 star5 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 star5)
   goals met: 7 of 7
